In [1]:
import pandas as pd

In [4]:
df = pd.read_csv("강의자료/실습파일/iris_missing.csv")
df.head()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN

In [5]:
df_na = df.head(7)
df_na

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [6]:
df_na["Sepal_Length"].isna() # 결측치 = True로 확인

0    False
1    False
2    False
3    False
4    False
5    False
6     True
Name: Sepal_Length, dtype: bool

In [7]:
df_na["Sepal_Length"].notna()

0     True
1     True
2     True
3     True
4     True
5     True
6    False
Name: Sepal_Length, dtype: bool

In [8]:
df_na["Sepal_Length"].isna().sum()  #결측치 개수 (True = 1 이므로...)

1

In [9]:
df_na.isna() #

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width  Species
0         False         True          True        False    False
1         False        False         False        False    False
2         False        False         False        False     True
3         False        False         False        False    False
4         False        False         False        False     True
5         False        False         False        False    False
6          True         True          True         True    False

In [10]:
df_na.isna().sum()  # 각 변수별 결측치 개수

Sepal_Length    1
Sepal_Width     2
Petal_Length    2
Petal_Width     1
Species         2
dtype: int64

In [11]:
df_na.isna().sum(axis=1)  # 각 row별 결측치 개수

0    2
1    0
2    1
3    0
4    1
5    0
6    4
dtype: int64

In [13]:
df_na.fillna(value = {"Sepal_Length": 999}) # Sepal_Length 결측치에 999를 채워 넣음.

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6         999.0          NaN           NaN          NaN  setosa

In [16]:
df_na.fillna(value = {"Sepal_Width": 999, # 2개 이상 입력할 경우
                     "Petal_Lenth": 999})

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1        999.0           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN        999.0           NaN          NaN  setosa

In [17]:
df_na.fillna(value = 999) # 모든 결측치에 동일한 값 입력 (권장하지 않음)

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1        999.0         999.0          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     999
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     999
5           5.4          3.9           1.7          0.4  setosa
6         999.0        999.0         999.0        999.0  setosa

In [19]:
df_na["Sepal_Width"].mean()  # 결측치를 제외한 평균값 계산

3.3600000000000003

In [20]:
df_na.fillna(value = {"Sepal_Width": df_na["Sepal_Width"].mean()})  # 결측치에 평균값 입력

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1         3.36           NaN          0.2  setosa
1           4.9         3.00           1.4          0.2  setosa
2           4.7         3.20           1.3          0.2     NaN
3           4.6         3.10           1.5          0.2  setosa
4           5.0         3.60           1.4          0.2     NaN
5           5.4         3.90           1.7          0.4  setosa
6           NaN         3.36           NaN          NaN  setosa

In [23]:
df_na   # 덮어쓰지 않음

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [25]:
df_na = df_na.fillna(value = {"Sepal_Width": df_na["Sepal_Width"].mean()})  # 덮어쓰기
df_na

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1         3.36           NaN          0.2  setosa
1           4.9         3.00           1.4          0.2  setosa
2           4.7         3.20           1.3          0.2     NaN
3           4.6         3.10           1.5          0.2  setosa
4           5.0         3.60           1.4          0.2     NaN
5           5.4         3.90           1.7          0.4  setosa
6           NaN         3.36           NaN          NaN  setosa

In [26]:
df_na2 = df.head(8)
df_na2

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa
7           5.0          3.4           NaN          0.2  setosa

In [27]:
df_na2.dropna()   # 하나라도 결측치가 포함되면 제외한 결과 출력

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
1           4.9          3.0           1.4          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

In [28]:
df_na2.dropna(how = "all")   # 모든 값이 결측치가 포함되면 제외한 결과 출력

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa
7           5.0          3.4           NaN          0.2  setosa

In [30]:
df_na2.iloc[:, :-1]  # 마지막 열을 제외한 결과

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4
6           NaN          NaN           NaN          NaN
7           5.0          3.4           NaN          0.2

In [31]:
df_na2.iloc[:, :-1].dropna(how = "all")

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4
7           5.0          3.4           NaN          0.2

In [32]:
df["Sepal_Length"].max()

7.9

In [34]:
df["Sepal_Length"].min()

4.3

In [35]:
df["Sepal_Length"].mean()

5.853846153846154

In [36]:
df["Sepal_Length"].quantile()  # 중위값 q=50 default

5.8

In [37]:
df["Sepal_Length"].median()  # 중위값 q=50

5.8

In [38]:
df["Sepal_Length"].quantile(q = 0.25)

5.1

In [39]:
df["Sepal_Length"].quantile(q = 0.50)

5.8

In [40]:
df["Sepal_Length"].quantile(q = 0.75)

6.4

In [43]:
# Q01. 각 수치형 변수의 결측치 개수 총합은?
df.iloc[:, :-1].isna().sum().sum()

40

In [48]:
# Q02. sepal_width 변수의 결측치를 평균으로 대치한 값의 분산은?
df2 = df.fillna(value = {"Sepal_Width": df["Sepal_Width"].mean()})
df2["Sepal_Width"].var()

0.17561945818840946

In [62]:
# Q03. 평균을 기준으로 1.5 표준편차를 넘어서는 값을 이상치라고 간주할 때
#      Sepal.Length 변수를 기준으로 이상치인 row 개수는 몇 개인가?
df3 = pd.read_csv("강의자료/실습파일/iris.csv")
sl_mean = df3["Sepal.Length"].mean()
sl_std = df3["Sepal.Length"].std()
cond_1 = df3["Sepal.Length"] < (sl_mean - 1.5 * sl_std)
cond_2 = df3["Sepal.Length"] > (sl_mean + 1.5 * sl_std)
df_out = df.loc[(cond_1) | (cond_2), ]   # or : |
len(df_out)

21